src/Catalogs/уатРабочиеСтолы/уатРабочиеСтолы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатРабочиеСтолы</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЗаказыМаршрутныеЛисты</name>
      <description>Заказы + Маршрутные листы</description>
    </items>
    <items>
      <name>ЗаказыСтатистикаМаршрутныеЛистыПланировщик</name>
      <description>Заказы + Статистика + Маршрутные листы + Планировщик</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>КартаПункты</name>
      <description>Карта + Пункты</description>
    </items>
    <items>
      <name>КартаСобытия</name>
      <description>Карта + События</description>
    </items>
  </predefined>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиПанелей</name>
    <attributes>
      <name>Панель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаОтчет</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ВариантыОтчетов</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатРабочиеСтолы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.ЗаказыМаршрутныеЛисты;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Заказы";
	Панели.Панель3 = "МаршрутныеЛисты";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'"), Панели);
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.ЗаказыСтатистикаМаршрутныеЛистыПланировщик;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Заказы";
	Панели.Панель2 = "Статистика";
	Панели.Панель3 = "МаршрутныеЛисты";
	Панели.Панель4 = "Планировщик";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Logistician'; ru = 'АРМ Логиста'"), Панели);
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.Карта;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Карта";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"), Панели);
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.КартаПункты;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Карта";
	Панели.Панель3 = "Пункты";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"), Панели);

	ТекЭлемент = Справочники.уатРабочиеСтолы.КартаСобытия;
	Панели = Новый Структура("Панель1, Панель2, Панель3, Панель4");
	Панели.Панель1 = "Карта";
	Панели.Панель3 = "События";
	ЗаполнитьРабочиеСтолы(ТекЭлемент, НСтр("en = 'AWP Transportation control'; ru = 'АРМ Контроль перевозок'"), Панели);
	
	ТекЭлемент = Справочники.уатРабочиеСтолы.НайтиПоНаименованию("Карта + Отчет ""Анализ план факта по Заказам""",Истина);
	Если ТекЭлемент.ПометкаУдаления Тогда
		СпрОбъект = ТекЭлемент.ПолучитьОбъект();
		СпрОбъект.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет поля элемента справочника "уатРабочиеСтолы"
//
Процедура ЗаполнитьРабочиеСтолы(РабочийСтол, Знач Назначение, Знач Панели)
	
	СпрОбъект = РабочийСтол.ПолучитьОбъект();
	СпрОбъект.Назначение = Назначение;
	СпрОбъект.НастройкиПанелей.Очистить();
	Для Счетчик = 1 По 4 Цикл
		НоваяСтрока = СпрОбъект.НастройкиПанелей.Добавить();
		НаименованиеПанели = "Панель" + Счетчик;
		НоваяСтрока.Панель   = НаименованиеПанели;
		Если Панели.Свойство(НаименованиеПанели) И ЗначениеЗаполнено(Панели[НаименованиеПанели]) Тогда
			Если ТипЗнч(Панели[НаименованиеПанели]) = Тип("Структура") Тогда
				НоваяСтрока.Значение      = Панели[НаименованиеПанели].Значение;
				НоваяСтрока.СсылкаНаОтчет = Панели[НаименованиеПанели].СсылкаНаОтчет;
			Иначе
				НоваяСтрока.Значение = Панели[НаименованиеПанели];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СпрОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
